# 题目描述：
# # 很多数列都是递推形成的，现在给出一个序列的前四项，a[1],a[2],a[3],a[4],已知递推式是a[n]=a[n-1]+a[n-3]+a[n-4]。请你求出第n项的值。
# #
# # 输入
# # 输入仅一行，包含4个正整数a[1],a[2],a[3],a[4]及n。
# #
# # 输出
# # 输出仅包含一个正整数，即a[n],但是由于这个数可能非常大，所以请输出答案对10^9+7取模的结果。
# #
# #
# # 样例输入
# # 1 2 3 4 20
# # 样例输出
# # 9790

# inp = input().split()
inp = "1 2 3 4 500000".split()
a = list(map(int, inp[:-1]))
n = int(inp[-1])
del inp

if n <= 4:
    print(a[n-1])
else:
    cur = 0
    for i in range(4, n):
        a[cur] += a[cur-1] + a[cur-3]
        cur = (cur + 1) % 4
    print(a[cur-1] % (10**9 + 7))
